tutorials/viscoelasticFluidFoam/Feta-PTT/0/etaPEff
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      etaPEff;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
108000
(
0.118747
0.118774
0.118686
0.11874
0.118662
0.118703
0.118672
0.118695
...
)
;

boundaryField
{
    fixedWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
10800
(
0.118747
0.118793
0.118799
0.118799
0.1188
0.1188
0.1188
0.1188
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.1188;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1800
(
0.1188
0.1188
0.118798
0.118799
0.118794
0.118794
0.118788
0.118786
...
)
;
    }
}


// ************************************************************************* //
