tutorials/viscoelasticFluidFoam/Feta-PTT/constant/viscoelasticProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          viscoelasticProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
From:
VERBEETEN, W. M. H. Computational polymer melt rheology. [S.l.]: CIP-Data Library
Technische Universiteit Eindhoven, 2001.

The polymer solution consists of 2.5% Polyisobutylene (Oppanol B200, BASF) dissolved
in tetradecane (2.5% PIB/C14).

Table 2.1: Material parameters of 2.5% polyisobutylene dissolved in tetradecane (2.5% PIB/C14) at
T = 20 C, obtained from Schoonen et al. (1998).
mode  G[Pa]   lambda[s]   epsilon    zeta    A     a     b
1     3.3e1   3.6e-3
2     3.6e0   3.1e-2      0.42       0.07   16.0  2.0   0.45
3     1.8e0   1.6e-1
4     5.1e-2  5.6e-1
*/

rheology
{

        type multiMode;

        models
        (

                first
                {
                type Feta-PTT;
                rho              rho [1 -3 0 0 0 0 0] 803.0;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.1188;
                lambda           lambda [0 0 1 0 0 0 0] 3.6e-3;
                epsilon          epsilon [0 0 0 0 0 0 0] 0.42;
                zeta             zeta [0 0 0 0 0 0 0] 0.07;
                A                A [0 0 0 0 0 0 0] 16.0;
                a                a [0 0 0 0 0 0 0] 2.0;
                b                b [0 0 0 0 0 0 0] 0.45;
                }

                second
                {
                type Feta-PTT;
                rho              rho [1 -3 0 0 0 0 0] 803.0;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.1116;
                lambda           lambda [0 0 1 0 0 0 0] 3.1e-2;
                epsilon          epsilon [0 0 0 0 0 0 0] 0.42;
                zeta             zeta [0 0 0 0 0 0 0] 0.07;
                A                A [0 0 0 0 0 0 0] 16.0;
                a                a [0 0 0 0 0 0 0] 2.0;
                b                b [0 0 0 0 0 0 0] 0.45;
                }

                third
                {
                type Feta-PTT;
                rho              rho [1 -3 0 0 0 0 0] 803.0;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.288;
                lambda           lambda [0 0 1 0 0 0 0] 1.6e-1;
                epsilon          epsilon [0 0 0 0 0 0 0] 0.42;
                zeta             zeta [0 0 0 0 0 0 0] 0.07;
                A                A [0 0 0 0 0 0 0] 16.0;
                a                a [0 0 0 0 0 0 0] 2.0;
                b                b [0 0 0 0 0 0 0] 0.45;
                }

                fourth
                {
                type Feta-PTT;
                rho              rho [1 -3 0 0 0 0 0] 803.0;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.02856;
                lambda           lambda [0 0 1 0 0 0 0] 5.6e-1;
                epsilon          epsilon [0 0 0 0 0 0 0] 0.42;
                zeta             zeta [0 0 0 0 0 0 0] 0.07;
                A                A [0 0 0 0 0 0 0] 16.0;
                a                a [0 0 0 0 0 0 0] 2.0;
                b                b [0 0 0 0 0 0 0] 0.45;
                }
       );

}



// ************************************************************************* //
